Ran Plan for project: `platform` dir: `2.platform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_cron_job_v1.vault_backup_daily will be created
+ resource "kubernetes_cron_job_v1" "vault_backup_daily" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "vault-backup-daily"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + concurrency_policy            = "Allow"
          + failed_jobs_history_limit     = 1
          + schedule                      = "0 2 * * *"
          + starting_deadline_seconds     = 0
          + successful_jobs_history_limit = 3
          + suspend                       = false

          + job_template {
              + metadata {
                  + generation       = (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + backoff_limit   = 6
                  + completion_mode = (known after apply)
                  + completions     = 1
                  + parallelism     = 1

                  + template {
                      + metadata {
                          + generation       = (known after apply)
                          + name             = (known after apply)
                          + resource_version = (known after apply)
                          + uid              = (known after apply)
                        }
                      + spec {
                          + automount_service_account_token  = true
                          + dns_policy                       = "ClusterFirst"
                          + enable_service_links             = true
                          + host_ipc                         = false
                          + host_network                     = false
                          + host_pid                         = false
                          + hostname                         = (known after apply)
                          + node_name                        = (known after apply)
                          + restart_policy                   = "OnFailure"
                          + scheduler_name                   = (known after apply)
                          + service_account_name             = "vault"
                          + share_process_namespace          = false
                          + termination_grace_period_seconds = 30

                          + container {
                              + args                       = [
                                  + <<-EOT
                                        set -e
                                        export VAULT_ADDR="http://vault.platform.svc.cluster.local:8200"
                                                        
                                        # Get root token from secret
                                        ROOT_TOKEN=$(cat /vault-keys/init-keys | jq -r '.root_token')
                                        export VAULT_TOKEN=$ROOT_TOKEN
                                                        
                                        # Create snapshot
                                        BACKUP_FILE="/backup/daily-$(date +%Y%m%d-%H%M%S).snap"
                                        vault operator raft snapshot save $BACKUP_FILE
                                        echo "Backup saved to $BACKUP_FILE"
                                                        
                                        # Cleanup old daily backups (keep 3 days)
                                        find /backup -name "daily-*.snap" -mtime +3 -delete
                                        echo "Cleaned up backups older than 3 days"
                                    EOT,
                                ]
                              + command                    = [
                                  + "/bin/sh",
                                  + "-c",
                                ]
                              + image                      = "hashicorp/vault:1.20.4"
                              + image_pull_policy          = (known after apply)
                              + name                       = "backup"
                              + stdin                      = false
                              + stdin_once                 = false
                              + termination_message_path   = "/dev/termination-log"
                              + termination_message_policy = (known after apply)
                              + tty                        = false

                              + volume_mount {
                                  + mount_path        = "/backup"
                                  + mount_propagation = "None"
                                  + name              = "backup"
                                  + read_only         = false
                                }
                              + volume_mount {
                                  + mount_path        = "/vault-keys"
                                  + mount_propagation = "None"
                                  + name              = "vault-keys"
                                  + read_only         = true
                                }
                            }

                          + volume {
                              + name = "backup"

                              + persistent_volume_claim {
                                  + claim_name = "vault-backup"
                                  + read_only  = false
                                }
                            }
                          + volume {
                              + name = "vault-keys"

                              + secret {
                                  + default_mode = "0644"
                                  + secret_name  = "vault-unseal-keys"
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # kubernetes_cron_job_v1.vault_backup_weekly will be created
+ resource "kubernetes_cron_job_v1" "vault_backup_weekly" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "vault-backup-weekly"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + concurrency_policy            = "Allow"
          + failed_jobs_history_limit     = 1
          + schedule                      = "0 3 * * 0"
          + starting_deadline_seconds     = 0
          + successful_jobs_history_limit = 4
          + suspend                       = false

          + job_template {
              + metadata {
                  + generation       = (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + backoff_limit   = 6
                  + completion_mode = (known after apply)
                  + completions     = 1
                  + parallelism     = 1

                  + template {
                      + metadata {
                          + generation       = (known after apply)
                          + name             = (known after apply)
                          + resource_version = (known after apply)
                          + uid              = (known after apply)
                        }
                      + spec {
                          + automount_service_account_token  = true
                          + dns_policy                       = "ClusterFirst"
                          + enable_service_links             = true
                          + host_ipc                         = false
                          + host_network                     = false
                          + host_pid                         = false
                          + hostname                         = (known after apply)
                          + node_name                        = (known after apply)
                          + restart_policy                   = "OnFailure"
                          + scheduler_name                   = (known after apply)
                          + service_account_name             = "vault"
                          + share_process_namespace          = false
                          + termination_grace_period_seconds = 30

                          + container {
                              + args                       = [
                                  + <<-EOT
                                        set -e
                                        export VAULT_ADDR="http://vault.platform.svc.cluster.local:8200"
                                                        
                                        # Get root token from secret
                                        ROOT_TOKEN=$(cat /vault-keys/init-keys | jq -r '.root_token')
                                        export VAULT_TOKEN=$ROOT_TOKEN
                                                        
                                        # Create snapshot
                                        BACKUP_FILE="/backup/weekly-$(date +%Y%m%d-%H%M%S).snap"
                                        vault operator raft snapshot save $BACKUP_FILE
                                        echo "Backup saved to $BACKUP_FILE"
                                                        
                                        # Cleanup old weekly backups (keep 4 weeks / 1 month)
                                        find /backup -name "weekly-*.snap" -mtime +28 -delete
                                        echo "Cleaned up backups older than 28 days"
                                    EOT,
                                ]
                              + command                    = [
                                  + "/bin/sh",
                                  + "-c",
                                ]
                              + image                      = "hashicorp/vault:1.20.4"
                              + image_pull_policy          = (known after apply)
                              + name                       = "backup"
                              + stdin                      = false
                              + stdin_once                 = false
                              + termination_message_path   = "/dev/termination-log"
                              + termination_message_policy = (known after apply)
                              + tty                        = false

                              + volume_mount {
                                  + mount_path        = "/backup"
                                  + mount_propagation = "None"
                                  + name              = "backup"
                                  + read_only         = false
                                }
                              + volume_mount {
                                  + mount_path        = "/vault-keys"
                                  + mount_propagation = "None"
                                  + name              = "vault-keys"
                                  + read_only         = true
                                }
                            }

                          + volume {
                              + name = "backup"

                              + persistent_volume_claim {
                                  + claim_name = "vault-backup"
                                  + read_only  = false
                                }
                            }
                          + volume {
                              + name = "vault-keys"

                              + secret {
                                  + default_mode = "0644"
                                  + secret_name  = "vault-unseal-keys"
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # kubernetes_job.vault_init will be created
+ resource "kubernetes_job" "vault_init" {
      + id                  = (known after apply)
      + wait_for_completion = true

      + metadata {
          + generation       = (known after apply)
          + labels           = (known after apply)
          + name             = "vault-init-9"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + backoff_limit              = 6
          + completion_mode            = (known after apply)
          + completions                = 1
          + parallelism                = 1
          + ttl_seconds_after_finished = "300"

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "OnFailure"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = "vault-init"
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + args                       = [
                          + <<-EOT
                                set -e
                                VAULT_ADDR="http://vault.platform.svc.cluster.local:8200"
                                            
                                echo "Waiting for Vault to be ready..."
                                until wget -q --spider $VAULT_ADDR/v1/sys/health 2>/dev/null; do
                                  echo "Vault not ready, waiting..."
                                  sleep 5
                                done
                                echo "Vault is ready!"
                                            
                                # Check if already initialized
                                INIT_STATUS=$(wget -qO- $VAULT_ADDR/v1/sys/init 2>/dev/null || echo '{"initialized":true}')
                                if echo "$INIT_STATUS" | grep -q '"initialized":false'; then
                                  echo "Initializing Vault..."
                                  INIT_RESPONSE=$(wget -qO- --post-data='{"secret_shares":5,"secret_threshold":3}' \
                                    --header="Content-Type: application/json" \
                                    $VAULT_ADDR/v1/sys/init)
                                              
                                  echo "$INIT_RESPONSE" > /tmp/init.json
                                              
                                  # Create K8s secret with init keys
                                  echo "Storing unseal keys in Kubernetes Secret..."
                                  kubectl create secret generic vault-unseal-keys -n platform \
                                    --from-file=init-keys=/tmp/init.json \
                                    --dry-run=client -o yaml | kubectl apply -f -
                                              
                                  # Extract and unseal with first 3 keys
                                  echo "Unsealing Vault..."
                                  KEY1=$(cat /tmp/init.json | sed 's/.*"keys_base64":\["\([^"]*\)".*/\1/')
                                  KEY2=$(cat /tmp/init.json | sed 's/.*"keys_base64":\["[^"]*","\([^"]*\)".*/\1/')
                                  KEY3=$(cat /tmp/init.json | sed 's/.*"keys_base64":\["[^"]*","[^"]*","\([^"]*\)".*/\1/')
                                              
                                  wget -qO- --post-data="{\"key\":\"$KEY1\"}" --header="Content-Type: application/json" $VAULT_ADDR/v1/sys/unseal
                                  wget -qO- --post-data="{\"key\":\"$KEY2\"}" --header="Content-Type: application/json" $VAULT_ADDR/v1/sys/unseal
                                  wget -qO- --post-data="{\"key\":\"$KEY3\"}" --header="Content-Type: application/json" $VAULT_ADDR/v1/sys/unseal
                                              
                                  rm /tmp/init.json
                                  echo "Vault initialized and unsealed successfully!"
                                else
                                  echo "Vault already initialized, skipping init"
                                              
                                  # Check if sealed and try to unseal
                                  SEAL_STATUS=$(wget -qO- $VAULT_ADDR/v1/sys/seal-status 2>/dev/null || echo '{"sealed":false}')
                                  if echo "$SEAL_STATUS" | grep -q '"sealed":true'; then
                                    echo "Vault is sealed, attempting unseal from stored keys..."
                                    KEYS_JSON=$(kubectl get secret -n platform vault-unseal-keys -o jsonpath='{.data.init-keys}' | base64 -d)
                                    KEY1=$(echo "$KEYS_JSON" | sed 's/.*"keys_base64":\["\([^"]*\)".*/\1/')
                                    KEY2=$(echo "$KEYS_JSON" | sed 's/.*"keys_base64":\["[^"]*","\([^"]*\)".*/\1/')
                                    KEY3=$(echo "$KEYS_JSON" | sed 's/.*"keys_base64":\["[^"]*","[^"]*","\([^"]*\)".*/\1/')
                                                
                                    wget -qO- --post-data="{\"key\":\"$KEY1\"}" --header="Content-Type: application/json" $VAULT_ADDR/v1/sys/unseal || true
                                    wget -qO- --post-data="{\"key\":\"$KEY2\"}" --header="Content-Type: application/json" $VAULT_ADDR/v1/sys/unseal || true
                                    wget -qO- --post-data="{\"key\":\"$KEY3\"}" --header="Content-Type: application/json" $VAULT_ADDR/v1/sys/unseal || true
                                    echo "Unseal attempted"
                                  else
                                    echo "Vault is already unsealed"
                                  fi
                                fi
                            EOT,
                        ]
                      + command                    = [
                          + "/bin/sh",
                          + "-c",
                        ]
                      + image                      = "bitnami/kubectl:latest"
                      + image_pull_policy          = (known after apply)
                      + name                       = "init"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false
                    }
                }
            }
        }

      + timeouts {
          + create = "10m"
        }
    }

  # kubernetes_persistent_volume_claim.vault_backup is tainted, so must be replaced
-/+ resource "kubernetes_persistent_volume_claim" "vault_backup" {
      ~ id               = "platform/vault-backup" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "vault-backup"
          ~ resource_version = "354425" -> (known after apply)
          ~ uid              = "60eec6a3-913e-4530-be44-d2c512aac302" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
          ~ volume_mode        = "Filesystem" -> (known after apply)
          + volume_name        = (known after apply)
            # (2 unchanged attributes hidden)

          ~ resources {
              - limits   = {} -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # kubernetes_role.vault_init will be created
+ resource "kubernetes_role" "vault_init" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "vault-init"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "",
            ]
          + resources  = [
              + "secrets",
            ]
          + verbs      = [
              + "create",
              + "get",
              + "patch",
              + "update",
            ]
        }
    }

  # kubernetes_role_binding.vault_init will be created
+ resource "kubernetes_role_binding" "vault_init" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "vault-init"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Role"
          + name      = "vault-init"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "vault-init"
          + namespace = "platform"
        }
    }

  # kubernetes_service_account.vault_init will be created
+ resource "kubernetes_service_account" "vault_init" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "vault-init"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://i-atlantis.truealpha.club/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`
</details>
Plan: 7 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`